## Устанавливаем необходимые библиотеки SQL для работы в JN

Устанавливаем MySQL https://dev.mysql.com/downloads/installer/

Устанавливаем необходимые библиотеки:

In [4]:
# !pip install pymysql # не надо
# !pip install ipython-sql
# !pip install mysqlclient
# !pip install mysql-connector-python #  не надо
# !pip install sqlalchemy

Устанавливаем соединениес MySQL:

In [1]:
import sqlalchemy

In [2]:
sqlalchemy.create_engine("mysql://root:123qwe@localhost/mydb")

Engine(mysql://root:***@localhost/mydb)

In [3]:
%load_ext sql

In [4]:
%sql mysql://root:123qwe@localhost/mydb

In [5]:
%%sql
DROP SCHEMA IF EXISTS stepik;
CREATE SCHEMA IF NOT EXISTS stepik;

 * mysql://root:***@localhost/mydb
0 rows affected.
1 rows affected.

[]

## 1.1.8 Создание таблицы

Сформулируйте SQL запрос для создания таблицы **book**, занесите  его в окно кода (расположено ниже)  и отправьте на проверку (кнопка **Отправить**). Структура таблицы **book**:

| Поле | Тип, описание |
| :- | :-|
| book_id | INT PRIMARY KEY AUTO_INCREMENT |
| title | VARCHAR(50) |
| author | VARCHAR(30) |
| price | DECIMAL(8, 2) |
| amount | INT |

In [7]:
%%sql
CREATE TABLE book(
    book_id INT PRIMARY KEY AUTO_INCREMENT,
    title VARCHAR(50),
    author VARCHAR(30),
    price DECIMAL(8, 2),
    amount INT
);

 * mysql://root:***@localhost/mydb
0 rows affected.

[]

In [9]:
%%sql
SELECT * FROM book;

 * mysql://root:***@localhost/mydb
0 rows affected.

[]

## 1.1.9 Вставка записи в таблицу

Занесите новую строку в таблицу **book** (текстовые значения (тип **VARCHAR**) заключать либо в двойные, либо в одинарные кавычки):
  
| book_id | title | author | price | amount |
| :- | :-| :-| :-| :-|
| INT PRIMARY KEY AUTO_INCREMENT | VARCHAR(50) | VARCHAR(30) | DECIMAL(8,2) | INT |
| 1 | Мастер и Маргарита | Булгаков М.А. | 670.99 | 3 |

In [10]:
%%sql
INSERT INTO book(title, author, price, amount)
VALUES ('Мастер и Маргарита', 'Булгаков М.А.', 670.99, 3);

 * mysql://root:***@localhost/mydb
1 rows affected.

[]

In [11]:
%%sql
SELECT * FROM book;

 * mysql://root:***@localhost/mydb
1 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3)]

## 1.1.10 Задание

Занесите три последние записи в таблицу **book**, первая запись уже добавлена на предыдущем шаге:
  
| book_id | title | author | price | amount |
| :- | :-| :-| :-| :-|
| INT PRIMARY KEY AUTO_INCREMENT | VARCHAR(50) | VARCHAR(30) | DECIMAL(8,2) | INT |
| 1 | Мастер и Маргарита | Булгаков М.А. | 670.99 | 3 |
| 2 | Белая гвардия | Булгаков М.А.| 540.50 | 5 |
| 3 | Идиот| Достоевский Ф.М. | 460.00 | 10 |
| 4 | Братья Карамазовы | Достоевский Ф.М. | 799.01 | 2 |

In [12]:
%%sql
INSERT INTO book(title, author, price, amount)
VALUES ('Белая гвардия', 'Булгаков М.А.', 540.50, 5),
       ('Идиот', 'Достоевский Ф.М.', 460.00, 10),
       ('Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2);

 * mysql://root:***@localhost/mydb
3 rows affected.

[]

### Для п.1.2 добавляем еще одну строку

In [15]:
%%sql
INSERT INTO book(title, author, price, amount)
VALUES ('Стихотворения и поэмы', 'Есенин С.А.', 650.00, 15);

 * mysql://root:***@localhost/mydb
1 rows affected.

[]

In [16]:
%%sql
SELECT * FROM book;

 * mysql://root:***@localhost/mydb
5 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15)]

## 2.1.2 Выборка всех данных из таблицы